backend/tests/load/basic_browsing.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 120
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "item_ids.csv"
    fields:
      - "id"

scenarios:
  - name: "Browse items and details"
    flow:
      - get:
          url: "/api/items"
      - think: 2
      - get:
          url: "/api/items/{{ id }}"
      - think: 1
      - get:
          url: "/api/categories"